## 7.1 处理缺失数据

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 滤除缺失数据

In [9]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')
# 删除全为NA的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -2.086752       NaN       NaN
1  0.883284       NaN       NaN
2  0.134075       NaN  0.320360
3 -1.461507       NaN  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [21]:
df.dropna()

          0         1         2
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [25]:
df.dropna(thresh=2)
# thresh: 应该是保留至少有n个非NaN数据的行/列

          0         1         2
2  0.134075       NaN  0.320360
3 -1.461507       NaN  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

### 填充缺失数据

In [26]:
df

          0         1         2
0 -2.086752       NaN       NaN
1  0.883284       NaN       NaN
2  0.134075       NaN  0.320360
3 -1.461507       NaN  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [27]:
df.fillna(0)

          0         1         2
0 -2.086752  0.000000  0.000000
1  0.883284  0.000000  0.000000
2  0.134075  0.000000  0.320360
3 -1.461507  0.000000  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [28]:
df.fillna({1: 0.5, 2: 0})
# 实现对不同的列填充不同值

          0         1         2
0 -2.086752  0.500000  0.000000
1  0.883284  0.500000  0.000000
2  0.134075  0.500000  0.320360
3 -1.461507  0.500000  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [29]:
_ = df.fillna(0, inplace=True)

In [30]:
df

          0         1         2
0 -2.086752  0.000000  0.000000
1  0.883284  0.000000  0.000000
2  0.134075  0.000000  0.320360
3 -1.461507  0.000000  0.774574
4 -0.411236 -0.015197 -2.490780
5  0.060523 -0.012805  0.611563
6 -1.976670 -0.228518  0.763408

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.017337  0.084168  0.656978
1 -0.585674  0.636875 -0.256940
2 -0.957888       NaN -1.185705
3 -0.848513       NaN -0.271084
4 -1.592795       NaN       NaN
5 -0.252213       NaN       NaN